#TODO НАПИСАТЬ ФУНКЦ. ПРИНИМАЮЩАЯ ДВА АРГУМЕНТА,
#  1 SHOPS СЛОВАРЬ, В КАЧЕСТВЕ КЛЮЧА КОТОРОГО ВЫСТУПАЕТ НАЗВАНИЕ МАГАЗИНА, А В КАЧЕСТВЕ ЗНАЧЕНИЯ, СПИСОК ТОВАРОВ
#   КОТОРОГО ЕСТЬ В ДАННОМ МАГАЗИНЕ
#  2. PRODUCT - НАЗВАНИЕ ТОВАРА
#  НЕОБХОДИМО ВЕРНУТЬ СПИСОК НАЗВАНИЙ  МАГАЗИНОВ , ОТСОРТИРОВАННЫЙ В АЛФАВИТНОМ ПОРЯДКЕ В КОТОРЫХ НЕТ ДАНОГО ТОВАРА
#* список названий отсортировать в алфавитном порядке игнорируя регист
#SHOPS={name_shops: products}
#shops={"6el":["food","drink","coffee","milk","phone","TV"],"21vek":["clothes","coffee","milk","phone","TV"],}

#result=[]
#for shops in
#def multiply(a)
  #  res=1
 #   for number in args:
  #      res *= number
 #   return

#TODO на вход функции поступает
# 1. строка содержащая слева разделенные пробелом
# 2. строка - окончание
# верните список слов. которые не заканчиваюся на на указанное окончание
words=["молоко словоко питер везави"]
#def func_words()
res=words.split( )
res1=res.endswith("око")
print (res)


